tests/testfiles/add_object.xml

<?xml version="1.0"?>
<soap:Envelope
    xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"
    soap:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"
    xmlns:cwmp="urn:dslforum-org:cwmp-1-0">
      <soap:Header>
        <cwmp:ID soap:mustUnderstand="1">1234</cwmp:ID>
      </soap:Header>
      <soap:Body>
        <cwmp:AddObject>
  	<cwmp:ObjectName>.a.c.</cwmp:ObjectName>
  	<cwmp:ParameterKey>Some Parameter Key</cwmp:ParameterKey>
        </cwmp:AddObject>
      </soap:Body>
  </soap:Envelope>
